#!/bin/bash

echo "Сборка программы Почты..."
echo "--------------------------------------------"

# Компилируем файл 3_4.c
gcc 3_4.c -o app_3_4

if [ $? -ne 0 ]; then
    echo "❌ Ошибка компиляции! Проверь код в 3_4.c"
    exit 1
fi

echo "✅ Успешно собрано. Запускаем интерактивное меню:"
echo "============================================"

# Запускаем программу и с помощью <<EOF автоматически передаем ей нажатия клавиш,
# чтобы не вводить данные каждый раз вручную.
./app_3_4 <<EOF
1
Moscow
Lenina
10 5
123456
11111111111111
1
Kazan
Baumana
2 15
654321
22222222222222
3
2
11111111111111
4
EOF

echo "============================================"
echo "Удаляем временный файл сборки..."
rm app_3_4
echo "Готово!"