#!/bin/bash

echo "Сборка интерпретатора многочленов..."
gcc 3_8.c -o app_3_8 -lm

if [ $? -ne 0 ]; then
    echo "❌ Ошибка компиляции!"
    exit 1
fi

echo "Генерация файла с инструкциями..."
cat <<EOF > script.txt
% Это однострочный комментарий
[ 
  Это многострочный 
  комментарий 
]
\$Add(2x^2)
Eval(1)
EOF

echo "✅ Запуск программы:"
echo "============================================"

./app_3_8 script.txt

echo "============================================"
echo "Удаление временных файлов..."
rm app_3_8 script.txt
echo "Готово!"