#!/bin/bash

echo "Сборка системы учета транспорта..."
gcc 3_6.c -o app_3_6 -lm

if [ $? -ne 0 ]; then
    echo "❌ Ошибка компиляции!"
    exit 1
fi

echo "Генерация файлов остановок..."
# Остановка 1 (координаты 10.0 20.0)
cat <<EOF > stop1.txt
10.0 20.0
BUS_77 23.10.2026 15:00:00 23.10.2026 15:05:00 START
BUS_99 23.10.2026 15:10:00 23.10.2026 15:12:00 INTERMEDIATE
EOF

# Остановка 2 (координаты 15.0 25.0)
cat <<EOF > stop2.txt
15.0 25.0
BUS_77 23.10.2026 16:00:00 23.10.2026 16:10:00 END
BUS_99 23.10.2026 14:00:00 23.10.2026 14:05:00 START
EOF

echo "✅ Запуск программы (авто-ввод):"
echo "============================================"

# Передаем два сгенерированных файла в качестве аргументов
./app_3_6 stop1.txt stop2.txt <<EOF
1
2
3
EOF

echo "============================================"
echo "Удаление временных файлов..."
rm app_3_6 stop1.txt stop2.txt
echo "Готово!"